Revit 2027 API
SpatialElementGeometryCalculator(Document, SpatialElementBoundaryOptions) Constructor
 Constructs a new calculator for the geometry of spatial elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpatialElementGeometryCalculator(
	Document aDoc,
	SpatialElementBoundaryOptions options
)
Public Sub New (
	aDoc As Document,
	options As SpatialElementBoundaryOptions
)
public:
SpatialElementGeometryCalculator(
	Document^ aDoc,
	SpatialElementBoundaryOptions^ options
)
new :
        aDoc : Document *
        options : SpatialElementBoundaryOptions -> SpatialElementGeometryCalculator
Parameters
aDoc Document
 The document that contains the spatial elements.
options SpatialElementBoundaryOptions
 The options to control the calculation rules.
Exceptions
Exception | Condition
ArgumentException |  options is not valid. Only Finish and Center of SpatialElementBoundaryLocation are allowed.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SpatialElementGeometryCalculator Class
SpatialElementGeometryCalculator Overload
Autodesk.Revit.DB Namespace